CPS-Projet/spec/bloc.org
* Bloc
** service : Bloc
** use : [[file:objet.org][Objet]]
** types : int, boolean, enum TYPE_Bloc {VIDE, FOSSE}, enum TYPE_Tresor {RIEN, DIXDOLLAR, CINQDOLLAR, CHAINEVELO, POUBELLEMETALLIQUE}

** observators :
*** 
**** const largeur : → int
**** const hauteur : → int
**** const profondeur : → int
**** const typeBloc : [Bloc]  → TYPE_Bloc
**** aTresor : [Bloc]  → boolean
**** typeTresor : [Bloc]  → TYPE_Tresor
***** pre typeTresor(B) require aTresor(B)

** Constructors :
*** 
**** init : TYPE_Bloc × TYPE_Tresor → [Bloc]
**** init : TYPE_Bloc → [Bloc]

** Operators :
*** 
**** ramasserTresor : [Bloc] → Objet
***** pre ramasserTresor(B) require aTresor(B)

**** deposerTresor : [Bloc] × Objet → [Bloc]
***** pre deposerTresor(B,o) require ¬aTresor(B)


** Observations : 
*** [invariants]
**** aTresor(B) =(min) typeTresor ≠ TYPE_Tresor.RIEN

*** [init]
**** largeur(init(b,t)) = 40
**** hauteur(init(b,t)) = 100
**** profondeur(init(b,t)) = 40
**** typeBloc(init(b,t)) = b
**** typeTresor(init(b,t)) = t

**** largeur(init(b)) = 10
**** hauteur(init(b)) = 10
**** profondeur(init(b)) = 10
**** typeBloc(init(b)) = b
**** typeTresor(init(b)) = TYPE_Tresor.RIEN

*** [ramasserTresor]
**** typeTresor(ramasserTresor(B)) = TYPE_Tresor.RIEN

*** [deposerTresor]
**** typeTresor(deposerTresor(B,t)) = Objet::type(t)

