CPS-Projet/spec/tex/bloc.tex
% Created 2014-04-18 ven. 12:57
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{amssymb}
\usepackage{hyperref}


\title{Bloc}
\author{Kevin Coquart, Quentin Bunel}
\date{18 avril 2014}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}
\section{Bloc}
\label{sec-1}

\subsection{service : Bloc}
\label{sec-1.1}

\subsection{use : Objet}
\label{sec-1.2}

\subsection{types : int, boolean, enum TYPE$_{\mathrm{Bloc}}$ \{VIDE, FOSSE\}, enum TYPE$_{\mathrm{Tresor}}$ \{RIEN, DIXDOLLAR, CINQDOLLAR, CHAINEVELO, POUBELLEMETALLIQUE\}}
\label{sec-1.3}


\subsection{observators :}
\label{sec-1.4}

\subsubsection{}

\begin{itemize}

\item const largeur : $\to$ int\\
\label{sec-1.4.1.1}


\item const hauteur : $\to$ int\\
\label{sec-1.4.1.2}


\item const profondeur : $\to$ int\\
\label{sec-1.4.1.3}


\item const typeBloc : [Bloc]  $\to$ TYPE$_{\mathrm{Bloc}}$\\
\label{sec-1.4.1.4}


\item aTresor : [Bloc]  $\to$ boolean\\
\label{sec-1.4.1.5}


\item typeTresor : [Bloc]  $\to$ TYPE$_{\mathrm{Tresor}}$\\
\label{sec-1.4.1.6}

\begin{itemize}

\item pre typeTresor(B) require aTresor(B)\\
\label{sec-1.4.1.6.1}


\end{itemize} % ends low level
\end{itemize} % ends low level
\subsection{Constructors :}
\label{sec-1.5}

\subsubsection{}

\begin{itemize}

\item init : TYPE$_{\mathrm{Bloc}}$ $\times$ TYPE$_{\mathrm{Tresor}}$ $\to$ [Bloc]\\
\label{sec-1.5.1.1}


\item init : TYPE$_{\mathrm{Bloc}}$ $\to$ [Bloc]\\
\label{sec-1.5.1.2}


\end{itemize} % ends low level
\subsection{Operators :}
\label{sec-1.6}

\subsubsection{}

\begin{itemize}

\item ramasserTresor : [Bloc] $\to$ Objet\\
\label{sec-1.6.1.1}

\begin{itemize}

\item pre ramasserTresor(B) require aTresor(B)\\
\label{sec-1.6.1.1.1}


\end{itemize} % ends low level

\item deposerTresor : [Bloc] $\times$ Objet $\to$ [Bloc]\\
\label{sec-1.6.1.2}

\begin{itemize}

\item pre deposerTresor(B,o) require $\neg$aTresor(B)\\
\label{sec-1.6.1.2.1}



\end{itemize} % ends low level
\end{itemize} % ends low level
\subsection{Observations :}
\label{sec-1.7}

\subsubsection{[invariants]}
\label{sec-1.7.1}

\begin{itemize}

\item aTresor(B) =(min) typeTresor $\neq$ TYPE$_{\mathrm{Tresor}}$.RIEN\\
\label{sec-1.7.1.1}


\end{itemize} % ends low level
\subsubsection{[init]}
\label{sec-1.7.2}

\begin{itemize}

\item largeur(init(b,t)) = 40\\
\label{sec-1.7.2.1}


\item hauteur(init(b,t)) = 100\\
\label{sec-1.7.2.2}


\item profondeur(init(b,t)) = 40\\
\label{sec-1.7.2.3}


\item typeBloc(init(b,t)) = b\\
\label{sec-1.7.2.4}


\item typeTresor(init(b,t)) = t\\
\label{sec-1.7.2.5}



\item largeur(init(b)) = 10\\
\label{sec-1.7.2.6}


\item hauteur(init(b)) = 10\\
\label{sec-1.7.2.7}


\item profondeur(init(b)) = 10\\
\label{sec-1.7.2.8}


\item typeBloc(init(b)) = b\\
\label{sec-1.7.2.9}


\item typeTresor(init(b)) = TYPE$_{\mathrm{Tresor}}$.RIEN\\
\label{sec-1.7.2.10}


\end{itemize} % ends low level
\subsubsection{[ramasserTresor]}
\label{sec-1.7.3}

\begin{itemize}

\item typeTresor(ramasserTresor(B)) = TYPE$_{\mathrm{Tresor}}$.RIEN\\
\label{sec-1.7.3.1}


\end{itemize} % ends low level
\subsubsection{[deposerTresor]}
\label{sec-1.7.4}

\begin{itemize}

\item typeTresor(deposerTresor(B,t)) = Objet::type(t)\\
\label{sec-1.7.4.1}


\end{itemize} % ends low level

\end{document}
